In [2]:
# Importing the necessary libraries -->
import numpy as np
import pandas as pd
import piplite
await piplite.install('jinja2')
await piplite.install('watermark')

## 01.Study the table carefully and answer the questions given below

In [5]:
# Making the DataFrame
d  = {'CAR/YEAR':['A','B','C','D','E'],
      '2013':[35,39,52,50,36],
      '2014':[40,45,25,42,46],
      '2015':[48,54,32,45,42],
      '2016':[50,60,54,46,48],
      '2017':[36,72,45,47,55]}

# DataFrame without any styling
# print("01.Study the table carefully and answer the questions given below:\n")
df=pd.DataFrame(data=d)
styles=[dict(selector="Caption",props=[("background-color", "cyan"),("font-size","120%"),("text-align", "middle"), ("color", 'blue'),("font-weight","bold")])]
df.style.set_caption('1.The table shows the production of different type of cars (in thousand)').set_table_styles(styles)

## Ex-01 The total production of car of type B in 2013,2014,2015 & 2017 taken together is what percent less than the total production of all types of cars in 2017 ?
a) 18.2% b) 18.4% c) 15.8 % d) 17.6%

In [3]:
print("Total production of Car B in 2013,2014,2015,2017 \n")
# See top 5 rows
df.head()

Total production of Car B in 2013,2014,2015,2017

  CAR/YEAR  2013  2014  2015  2016  2017
0        A    35    40    48    50    36
1        B    39    45    54    60    72
2        C    52    25    32    54    45
3        D    50    42    45    46    47
4        E    36    46    42    48    55

In [4]:
# Sum rows for col1,2,3 and col5
dflist=['2013','2014','2015','2017']
df['Results']=df[dflist].sum(axis=1)
df

  CAR/YEAR  2013  2014  2015  2016  2017  Results
0        A    35    40    48    50    36      159
1        B    39    45    54    60    72      210
2        C    52    25    32    54    45      154
3        D    50    42    45    46    47      184
4        E    36    46    42    48    55      179

In [5]:
df.sum(axis=0)

CAR/YEAR    ABCDE
2013          212
2014          198
2015          221
2016          258
2017          255
Results       886
dtype: object

In [6]:
# Group by Mean of a Single Column
df.groupby('CAR/YEAR')['2013'].mean()

CAR/YEAR
A    35.0
B    39.0
C    52.0
D    50.0
E    36.0
Name: 2013, dtype: float64

In [7]:
# Average marks for each Car
df.groupby('CAR/YEAR')['2013'].agg('mean')

CAR/YEAR
A    35.0
B    39.0
C    52.0
D    50.0
E    36.0
Name: 2013, dtype: float64

In [8]:
# mean value and project submissions for each car
df.groupby('CAR/YEAR')[['2013', '2014']].mean()

          2013  2014
CAR/YEAR
A         35.0  40.0
B         39.0  45.0
C         52.0  25.0
D         50.0  42.0
E         36.0  46.0

In [9]:
# mean value and project submissions for each car
df.groupby('CAR/YEAR')[['2013', '2014']].agg('mean')

          2013  2014
CAR/YEAR
A         35.0  40.0
B         39.0  45.0
C         52.0  25.0
D         50.0  42.0
E         36.0  46.0

In [10]:
df.columns

Index(['CAR/YEAR', '2013', '2014', '2015', '2016', '2017', 'Results'], dtype='object')

In [11]:
df.iloc[1]

CAR/YEAR      B
2013         39
2014         45
2015         54
2016         60
2017         72
Results     210
Name: 1, dtype: object

In [12]:
df.iloc[[0,1]]

  CAR/YEAR  2013  2014  2015  2016  2017  Results
0        A    35    40    48    50    36      159
1        B    39    45    54    60    72      210

In [13]:
df.iloc[[0,1],2]

0    40
1    45
Name: 2014, dtype: int64

In [14]:
df

  CAR/YEAR  2013  2014  2015  2016  2017  Results
0        A    35    40    48    50    36      159
1        B    39    45    54    60    72      210
2        C    52    25    32    54    45      154
3        D    50    42    45    46    47      184
4        E    36    46    42    48    55      179

In [15]:
df.loc[1]

CAR/YEAR      B
2013         39
2014         45
2015         54
2016         60
2017         72
Results     210
Name: 1, dtype: object

In [16]:
df.loc[[0,1]]

  CAR/YEAR  2013  2014  2015  2016  2017  Results
0        A    35    40    48    50    36      159
1        B    39    45    54    60    72      210

In [17]:
df.loc[[0,1],'2017']

0    36
1    72
Name: 2017, dtype: int64

In [18]:
df.loc[[0,1],['2016','2017']]

   2016  2017
0    50    36
1    60    72

In [19]:
df.head()

  CAR/YEAR  2013  2014  2015  2016  2017  Results
0        A    35    40    48    50    36      159
1        B    39    45    54    60    72      210
2        C    52    25    32    54    45      154
3        D    50    42    45    46    47      184
4        E    36    46    42    48    55      179

In [20]:
df.shape

(5, 7)

In [21]:
df['2017']

0    36
1    72
2    45
3    47
4    55
Name: 2017, dtype: int64

In [22]:
df.loc[0]

CAR/YEAR      A
2013         35
2014         40
2015         48
2016         50
2017         36
Results     159
Name: 0, dtype: object

In [23]:
df.loc[0,'2017']

36

In [24]:
df.loc[[0,1,2],'2017']

0    36
1    72
2    45
Name: 2017, dtype: int64

In [25]:
df.loc[0:2,'2017']

0    36
1    72
2    45
Name: 2017, dtype: int64

In [32]:
df.loc[0:2,'2013':'2017']

   2013  2014  2015  2016  2017
0    35    40    48    50    36
1    39    45    54    60    72
2    52    25    32    54    45

In [30]:
df.set_index('CAR/YEAR')

          2013  2014  2015  2016  2017  Results
CAR/YEAR
A           35    40    48    50    36      159
B           39    45    54    60    72      210
C           52    25    32    54    45      154
D           50    42    45    46    47      184
E           36    46    42    48    55      179

In [31]:
df

  CAR/YEAR  2013  2014  2015  2016  2017  Results
0        A    35    40    48    50    36      159
1        B    39    45    54    60    72      210
2        C    52    25    32    54    45      154
3        D    50    42    45    46    47      184
4        E    36    46    42    48    55      179

4. Print Dependences
Dependences are fundamental to record the Computational Environment.
- Use watermark to print version of python,ipython and characteristics of the computer

In [47]:
%load_ext watermark
# python,ipython,packages,and machine characteristics.
# %watermark --iversion
# %watermark

%watermark -v -m -p pandas,numpy,watermark,piplite,jinja2

# date 
print (" ")
%water -u -n -t -z

The watermark extension is already loaded. To reload it, use:
  %reload_ext watermark
Python implementation: CPython
Python version       : 3.10.2
IPython version      : 8.4.0

pandas   : 1.4.2
numpy    : 1.22.3
watermark: 2.3.1
piplite  : 0.1.0b10
jinja2   : 3.1.1

Compiler    : Clang 14.0.0 (https://github.com/llvm/llvm-project 78e87970af888bbbd5652c31f3a8
OS          : Emscripten
Release     : 1.0
Machine     : wasm32
Processor   :
CPU cores   : 1
Architecture: 32bit

UsageError: Line magic function `%water` not found.